# NumPy & Pandas

## NumPy

Como está dito no próprio _site_ do `NumPy` (https://www.numpy.org/):

_NumPy is the fundamental package for scientific computing with Python. It contains among other things:_

   * _a powerful N-dimensional array object_
   * _sophisticated (broadcasting) functions_
   * _tools for integrating C/C++ and Fortran code_
   * _useful linear algebra, Fourier transform, and random number capabilities_

_Besides its obvious scientific uses, NumPy can also be used as an efficient multi-dimensional container of generic data._

Em outras palavras, `NumPy` é uma biblioteca disponível em `Python` para manipulação de forma eficiente de matrizes multidimensionais.

Para usarmos o `NumPy` em nosso código, devemos antes importá-lo. É praxe fazê-lo da seguinte forma (para que possamos mais tarde nos referir a ele simplesmente como `np`):

In [1]:
import numpy as np

Para criar um `array` (uma matriz) do `NumPy` podemos executar este código:

In [2]:
x = np.array([2, 3, 1, 0])

E, para ver seu conteúdo, basta imprimi-lo:

In [3]:
print(x)

[2 3 1 0]

Agora, uma matriz bidimensional:
<img src="array.png" />

In [4]:
bidim = np.array([[1, 2, 3],
                  [4, 5, 6],
                  [7, 8, 9]])

In [5]:
print(bidim)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

Note o tipo do _array_ criado:

In [6]:
type(bidim)

numpy.ndarray

Uma característica importante de matrizes (`arrays`) quando falamos em programação de computadores é o acesso eficiente a qualquer um de seus ítens: basta informar qual exatamente é a _"célula"_ desejada.

Usando nossa matriz bidimensional criada anteriormente, para obtermos o valor na terceira coluna da segunda linha, basta usarmos:

In [7]:
# Lembre-se: em Python, começamos a "contar" a partir do Zero!
print(bidim[1, 2])

6

No decorrer do nosso treinamento, faremos pouco uso direto do `NumPy`: em geral, utilizaremos o `Pandas`, outra biblioteca disponível em `Python`, construída sobre a base do `NumPy`.

## Pandas

`Pandas` é talvez a principal ferramenta quando se fala em _Data Science_ e `Python`. Utilizando os recursos do `NumPy`, ela oferece a estrutura de `DataFrames`, que de certa forma traz para o `Python` o conceito de __planilhas__ a que já estamos bastante acostumados após tantos anos utilizando o `Excel`.

Por padrão, importamos o `Pandas` em nossos programas como `pd`:

In [8]:
import pandas as pd

Antes de começarmos a utilizá-la, entretanto, é necessário que entendamos alguns conceitos:

### Series

Uma `Series` no `Pandas` nada mais é do que uma matriz unidimensional com um índice de acesso:

<img src="serie.png" />

In [9]:
s = pd.Series(["Um", "Dois", "Três", "Quatro"])

In [10]:
print(s)

0        Um
1      Dois
2      Três
3    Quatro
dtype: object

É importante notar aqui que há apenas uma dimensão (`Um`, `Dois`, `Três` e `Quatro`), e que o índice (`0`, `1`, `2` e `3`) não faz parte dos dados, mas apenas da identificação de cada ítem.

O índice não precisa ser necessáriamente numérico: ele pode conter dicas mais úteis sobre o ítem que identifica:

<img src="capitais.png" />

In [11]:
capitais = pd.Series(["Brasília", "Berlim", "Londres", "Montevidéu"],
                     index=["Brasil", "Alemanha", "Inglaterra", "Uruguai"])

In [12]:
print(capitais)

Brasil          Brasília
Alemanha          Berlim
Inglaterra       Londres
Uruguai       Montevidéu
dtype: object

Também é possível acessar ítens individuais de uma `Series`:

In [13]:
print(capitais['Alemanha'])

Berlim

Ou um _range_ de ítens consecutivos:

In [14]:
print(capitais['Alemanha':'Inglaterra'])

Alemanha       Berlim
Inglaterra    Londres
dtype: object

Assim como com listas e outros objetos nativos do `Python`, também é possível acessar _"fatias"_ (_"slices"_) da `Serie`:

In [15]:
print("Primeiras duas capitais:\n", capitais[:2])

Primeiras duas capitais:
 Brasil      Brasília
Alemanha      Berlim
dtype: object

In [16]:
print("Última capital:\n", capitais[-1:])

Última capital:
 Uruguai    Montevidéu
dtype: object

Note que, quando usamos o _label_ dos índices (`capitais['Alemanha':'Inglaterra']`), os dois ítens foram incluídos na resposta; já quando usamos _slices_ padrões do `Python` (`capitais[:2]`), por exemplo, o comportamento padrão foi observado.

A esta altura, você deve estar se perguntando: _E se o índice for numérico?_

Bom, a melhor forma de descobrir é testando :)

In [17]:
# cria uma Serie com índices definidos de 1 a 5 para facilitar a identificação
duvida = pd.Series([100, 200, 300, 400, 500], index=[1, 2, 3, 4, 5])

In [18]:
print(duvida)

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [19]:
# o que será exibido?
print(duvida[2:4])

3    300
4    400
dtype: int64

<img src="series_3.png" />

Como podemos verificar, quando valores inteiros são passados dentro dos colchetes, eles são interpretados como acontece no `Python` padrão, e não como _labels_.

### DataFrames

__DataFrames__ são estruturas definidas pelo `Pandas` para representar matrizes de uma ou mais dimensões:

<img src="df_2.png" />

Note que, em um `DataFrame`, há um índice, como no caso da `Series`, e também um identificador para cada __colunas__:

In [20]:
numeros = pd.DataFrame({ "Português": ["Zero", "Um", "Dois", "Três", "Quatro"],
                         "Inglês": ["Zero", "One", "Two", "Three", "Four"],
                         "Alemão": ["null", "eins", "zwei", "drei", "vier"]})

In [21]:
print(numeros)

  Português Inglês Alemão
0      Zero   Zero   null
1        Um    One   eins
2      Dois    Two   zwei
3      Três  Three   drei
4    Quatro   Four   vier

Ou, como estamos no `Jupyter Notebook`, para ver um `DataFrame` podemos simplesmente:

In [22]:
numeros

  Português Inglês Alemão
0      Zero   Zero   null
1        Um    One   eins
2      Dois    Two   zwei
3      Três  Three   drei
4    Quatro   Four   vier

### Operações comuns sobre um `DataFrame`

`Pandas` só se tornou tão popular porque oferece um número enorme de funções para manipulação dos dados.

Veremos a seguir algumas delas, mas há ainda muito mais.

#### `shape`

`.shape` exibe a quantidade de linhas e colunas de um `DataFrame`.

Por exemplo, o `DataFrame` que acabamos de definir, `numeros`, tem cinco linhas e três colunas (lembre-se: o índice não é considerado como _"dado"_ e, portanto, não é contado!)

In [23]:
numeros.shape

(5, 3)

#### `dtypes`

`.dtypes` exibe o tipo dos dados de cada coluna de um `DataFrame`. Observe que cada coluna só pode ter um tipo de dados único.

In [24]:
numeros.dtypes

Português    object
Inglês       object
Alemão       object
dtype: object

In [25]:
# para uso no exemplo
from datetime import datetime

bagunca = pd.DataFrame({"texto": ["esta", "coluna", "contém", "strings"],
                        "inteiros": [1, 2, 3, 4],
                        "decimais": [1.5, 3.14, -8.28, 1.3e3],
                        "datas": [ datetime(1910, 9, 1), datetime(2000, 1, 14), datetime(2012, 12, 16), datetime.today()]})

In [26]:
bagunca

     texto  inteiros  decimais                      datas
0     esta         1      1.50 1910-09-01 00:00:00.000000
1   coluna         2      3.14 2000-01-14 00:00:00.000000
2   contém         3     -8.28 2012-12-16 00:00:00.000000
3  strings         4   1300.00 2019-04-24 21:56:37.344109

In [27]:
bagunca.dtypes

texto               object
inteiros             int64
decimais           float64
datas       datetime64[ns]
dtype: object

Como cada coluna só pode ter um tipo único de dados, se misturarmos valores de tipos diferentes em uma coluna ela assumirá o tipo `object`:

In [28]:
bagunca = pd.DataFrame({"texto": ["esta", "coluna", "contém", "strings"],
                        "inteiros": [1, 2, 3, 4],
                        "decimais": [1.5, 3.14, -8.28, 1.3e3],
                        "datas": [datetime(1997, 3, 15), 
                                  datetime(2015, 1, 1), 
                                  datetime(2019, 4, 23),
                                  datetime.today()],
                        "misturado?": [ 1, "teste", 3.48, np.nan]})

In [29]:
bagunca

     texto  inteiros  decimais                      datas misturado?
0     esta         1      1.50 1997-03-15 00:00:00.000000          1
1   coluna         2      3.14 2015-01-01 00:00:00.000000      teste
2   contém         3     -8.28 2019-04-23 00:00:00.000000       3.48
3  strings         4   1300.00 2019-04-24 21:56:37.373629        NaN

In [30]:
bagunca.dtypes

texto                 object
inteiros               int64
decimais             float64
datas         datetime64[ns]
misturado?            object
dtype: object

#### `head` e `tail`

Os métodos `.head()` e `.tail()` de um `DataFrame` nos permitem inspecionar suas primeiras e últimas linhas, respectivamente:

In [31]:
# define a "semente" do gerador de números (pseudo-)randômicos; assim, os números serão sempre os mesmos
np.random.seed(666)

# cria um array numpy de 100 linhas e 5 colunas com inteiros randômicos variando entre 0 e 4999
dados = np.random.randint(0, 5000, size=(100, 5))

# agora cria um dataframe a partir deste array e nomeia as colunas como "A", "B", ..., "E"
grande = pd.DataFrame(dados, columns=list('ABCDE'))

In [32]:
grande.shape

(100, 5)

In [33]:
grande.dtypes

A    int64
B    int64
C    int64
D    int64
E    int64
dtype: object

In [34]:
grande.head()

      A     B     C     D     E
0  1922  1950  2878    70  1993
1  2462  1469  1115   222   563
2  2204  2830  2785   575  2448
3  3118  4584   807  3141   204
4  4047  2189   885  2324  1163

In [35]:
grande.tail()

       A     B     C     D     E
95  2748  1053  2920  3451  1525
96   852    95   167  1215  4551
97  2701  1737  4942  3828   877
98  4696  1776  4246  4392  2835
99     4   362   880   932  3458

Também é possível definir qual o número de linhas desejadas:

In [36]:
grande.head(3)

      A     B     C    D     E
0  1922  1950  2878   70  1993
1  2462  1469  1115  222   563
2  2204  2830  2785  575  2448

In [37]:
grande.tail(8)

       A     B     C     D     E
92  4165  2509  3912  4053  3000
93  3859  3945  1217  1309  1435
94  3015  2563  2614  2047  2881
95  2748  1053  2920  3451  1525
96   852    95   167  1215  4551
97  2701  1737  4942  3828   877
98  4696  1776  4246  4392  2835
99     4   362   880   932  3458

#### `sample`

`sample` retorna uma amostra dos dados do `DataFrame` com o tamanho desejado:

In [38]:
grande.sample(5)

       A     B     C     D     E
16  1834  3361  4391  3621  3922
91  2493  4026    25  1072  1246
11  2667  1991  1407  1748  1683
58   764  2094   391  2420  3806
1   2462  1469  1115   222   563

Também é possível informar o porcentual desejado de linhas do `DataFrame` original:

In [39]:
grande.sample(frac=0.1)

       A     B     C     D     E
74   239  4199  4789   524   951
38  1607  1916  1033  1845  3212
39  2405  1921  2237  2028   148
43  1974  1102  4606  3056  3420
36   643  1391  2111   570  1974
72  3124  1406  2772  1007   779
70  2578  1043  3857   541  1154
59  4946  4430  4716  3393  3303
90  2003  3384   674  2708  1193
6    687  1956  4357   554  4769

E, caso se deseje que o `sample` retorne sempre o mesmo sub-conjunto, pode-se usar o parâmetro `random_state` (de forma similar a `np.random.seed` já utilizado anteriormente):

In [40]:
grande.sample(frac=0.05, random_state=33)

       A     B     C     D     E
56  4639  2314  3140   329  2976
90  2003  3384   674  2708  1193
95  2748  1053  2920  3451  1525
82  4968  4130  3207   322  2495
60  1428  1859  3113  1576  3531

Também é possível obter um sub-conjunto (pseudo-)aleatório de colunas:

In [41]:
grande.sample(2, axis="columns", random_state=33).head()

      B     C
0  1950  2878
1  1469  1115
2  2830  2785
3  4584   807
4  2189   885

#### Indexing

_Indexing_ é o termo utilizado quando nos referimos à seleção de sub-conjuntos de um `DataFrame`. O `Pandas` é muito flexível neste aspecto, disponibilizando várias formas de acesso.

Para entender melhor como isso funciona, vamos criar um novo `DataFrame`:

In [42]:
cervejas = pd.DataFrame([["Vedett", "IPA", "Bélgica", 0.33, 5.5],
                         ["Eisenbahn", "Strong Golden Ale", "Brasil", 0.355, 8.0],
                         ["Belhaven", "Rich Scottish Ale", "Escócia", 0.33, 7.4],
                         ["Robinsons", "Premium Britisch Beer", "Inglaterra", 0.5, 4.7],
                         ["Brewdog", "IPA", "Escócia", 0.33, 5.6],
                         ["Fuller's", "Superior Strong Ale", "Inglaterra", 0.5, 8.5],
                         ["Goose", "Session IPA", "Brasil", 0.355, 4.1]],
                        index=["Vedett IPA", "Eisenbahn", "90 Wee Heavy", "Trooper", "Punk IPA", "Golden Pride", "Midway"],
                        columns=["Fabricante", "Tipo", "País", "Volume", "Graduação Alcoólica"])

In [43]:
cervejas

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
Vedett IPA,Vedett,IPA,Bélgica,0.330,5.5
Eisenbahn,Eisenbahn,Strong Golden Ale,Brasil,0.355,8.0
90 Wee Heavy,Belhaven,Rich Scottish Ale,Escócia,0.330,7.4
Trooper,Robinsons,Premium Britisch Beer,Inglaterra,0.500,4.7
Punk IPA,Brewdog,IPA,Escócia,0.330,5.6
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.500,8.5
Midway,Goose,Session IPA,Brasil,0.355,4.1

Por exemplo, para se obter o valor da célula correspondente à quarta linha na coluna __'Fabricante'__:

In [44]:
linha = 3              # lembre-se: a primeira linha é a ZERO!
coluna = 'Fabricante'
cervejas[coluna][linha]

'Robinsons'

Para obter uma coluna inteira:

In [45]:
cervejas["País"].head()

Vedett IPA         Bélgica
Eisenbahn           Brasil
90 Wee Heavy       Escócia
Trooper         Inglaterra
Punk IPA           Escócia
Name: País, dtype: object

Já para obter uma linha completa, é necessário usar os métodos `.iloc` (para obter a linha a partir de seu número) ou `.loc` (para obter a linha a partir do _label_ de seu índice).

In [46]:
cervejas.iloc[2]

Fabricante                      Belhaven
Tipo                   Rich Scottish Ale
País                             Escócia
Volume                              0.33
Graduação Alcoólica                  7.4
Name: 90 Wee Heavy, dtype: object

In [47]:
cervejas.loc['Punk IPA']

Fabricante             Brewdog
Tipo                       IPA
País                   Escócia
Volume                    0.33
Graduação Alcoólica        5.6
Name: Punk IPA, dtype: object

Observem que o índice não faz parte do retorno!

`.loc` também permite selecionar um conjunto de linhas consecutivas, sempre indicando os _labels_ do índice:

In [48]:
cervejas.loc['Trooper':'Golden Pride']

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
Trooper,Robinsons,Premium Britisch Beer,Inglaterra,0.50,4.7
Punk IPA,Brewdog,IPA,Escócia,0.33,5.6
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.50,8.5

E também colunas:

In [49]:
cervejas.loc['Trooper':'Golden Pride', 'Fabricante':'País']

             Fabricante                   Tipo        País
Trooper       Robinsons  Premium Britisch Beer  Inglaterra
Punk IPA        Brewdog                    IPA     Escócia
Golden Pride   Fuller's    Superior Strong Ale  Inglaterra

Caso as linhas e colunas desejadas não sejam consecutivas, também é possível usar listas:

In [50]:
cervejas.loc[['Punk IPA', 'Eisenbahn', 'Midway'], ['Fabricante', 'Graduação Alcoólica', 'País']]

          Fabricante  Graduação Alcoólica     País
Punk IPA     Brewdog                  5.6  Escócia
Eisenbahn  Eisenbahn                  8.0   Brasil
Midway         Goose                  4.1   Brasil

Os intervalos informados também podem ser _"abertos"_:

In [52]:
# todas as linhas até 'Trooper',
# todas as colunas a partir de 'Volume'
cervejas.loc[:'Trooper', 'Volume':]

              Volume  Graduação Alcoólica
Vedett IPA     0.330                  5.5
Eisenbahn      0.355                  8.0
90 Wee Heavy   0.330                  7.4
Trooper        0.500                  4.7

Note que, assim como já vimos em outras situações, quando usamos _labels_ para indicar o intervalo (como é obrigatório com a função `loc`), o último item identificado faz parte da resposta!

Para obter todas as linhas, pode-se simplesmente indicar `:` como primeiro parâmetro:

In [53]:
cervejas.loc[:, ['Fabricante', 'País']]

             Fabricante        País
Vedett IPA       Vedett     Bélgica
Eisenbahn     Eisenbahn      Brasil
90 Wee Heavy   Belhaven     Escócia
Trooper       Robinsons  Inglaterra
Punk IPA        Brewdog     Escócia
Golden Pride   Fuller's  Inglaterra
Midway            Goose      Brasil

(mas, neste caso, `cervejas[['Fabricante', 'País']]` seria mais simples e teria o mesmo resultado.)

__`iloc`__, por sua vez, tem sintaxe similar a `loc`, mas aceita apenas números para indicar as linhas e colunas desejadas. E, já que usamos números, volta a prevalecer a regra padrão do `Python`: o primeiro número indica o primeiro ítem a ser incluído no resultado, e o segundo indica o primeiro que ficará "de fora".

In [55]:
cervejas.iloc[1:3, 4:]

              Graduação Alcoólica
Eisenbahn                     8.0
90 Wee Heavy                  7.4

In [56]:
cervejas.iloc[[5, 1, 3], -2:]

              Volume  Graduação Alcoólica
Golden Pride   0.500                  8.5
Eisenbahn      0.355                  8.0
Trooper        0.500                  4.7

#### Filtragem

Uma outra forma de selecionar linhas de um `DataFrame` é filtrando apenas aquelas que satisfazem a uma _regra_ (ou _predicado_, no jargão dos programadores). Para entender como isso funciona, devemos antes ver como criar uma `Series` apenas com `True` e `False` para indicar quais linhas satisfazem a uma determinada regra:

In [59]:
garrafas_grandes = cervejas['Volume'] >= 0.5

In [60]:
garrafas_grandes

Vedett IPA      False
Eisenbahn       False
90 Wee Heavy    False
Trooper          True
Punk IPA        False
Golden Pride     True
Midway          False
Name: Volume, dtype: bool

Conferindo:

In [62]:
cervejas['Volume']

Vedett IPA      0.330
Eisenbahn       0.355
90 Wee Heavy    0.330
Trooper         0.500
Punk IPA        0.330
Golden Pride    0.500
Midway          0.355
Name: Volume, dtype: float64

Agora, aplicamos a filtragem:

In [63]:
cervejas[garrafas_grandes]

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
Trooper,Robinsons,Premium Britisch Beer,Inglaterra,0.5,4.7
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.5,8.5

Parece que na Inglaterra eles preferem as garrafas de 500ml !

Agora, em uma única etapa:

In [65]:
cervejas[cervejas['Graduação Alcoólica'] > 5.0]

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
Vedett IPA,Vedett,IPA,Bélgica,0.330,5.5
Eisenbahn,Eisenbahn,Strong Golden Ale,Brasil,0.355,8.0
90 Wee Heavy,Belhaven,Rich Scottish Ale,Escócia,0.330,7.4
Punk IPA,Brewdog,IPA,Escócia,0.330,5.6
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.500,8.5

E juntando os dois filtros:

In [67]:
cervejas[(cervejas['Volume'] >= 0.5) & (cervejas['Graduação Alcoólica'] > 5.0)]

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.5,8.5

__ATENÇÃO__: note os parênteses na expressão acima! Se você os remover, o `Python` vai reclamar que não se pode comparar um _float_ com um valor _booleano_!

Também é possível filtrar apenas valores que se encontram em uma lista:

In [71]:
reino_unido = ['Inglaterra', 'Escócia', 'País de Gales', 'Irlanda do Norte']
cervejas[cervejas['País'].isin(reino_unido)]

,Fabricante,Tipo,País,Volume,Graduação Alcoólica
90 Wee Heavy,Belhaven,Rich Scottish Ale,Escócia,0.33,7.4
Trooper,Robinsons,Premium Britisch Beer,Inglaterra,0.50,4.7
Punk IPA,Brewdog,IPA,Escócia,0.33,5.6
Golden Pride,Fuller's,Superior Strong Ale,Inglaterra,0.50,8.5